{
  "4": {
    "name": "Batik Kawung",
    "desc": "Batik Kawung is one of Indonesia's oldest and most recognizable batik motifs, originating from the royal courts of Central Java. Its design is characterized by a classic geometric pattern of four intersecting circles or ovals, often with a small dot or rhombus at the center, resembling the cross-section of the aren palm fruit (known as kawung). This ancient pattern carries deep philosophical meaning, symbolizing purity, perfection, and the universe's structure. The four main circles represent the cardinal directions, while the center signifies the source of universal energy, embodying the hope that the wearer will be a wise and just individual who is useful to society.",
    "asal": ["Yogyakarta", "Jawa Tengah"]
  },
  "5": {
    "name": "Batik Kawung",
    "desc": "Batik Kawung is one of Indonesia's oldest and most recognizable batik motifs, originating from the royal courts of Central Java. Its design is characterized by a classic geometric pattern of four intersecting circles or ovals, often with a small dot or rhombus at the center, resembling the cross-section of the aren palm fruit (known as kawung). This ancient pattern carries deep philosophical meaning, symbolizing purity, perfection, and the universe's structure. The four main circles represent the cardinal directions, while the center signifies the source of universal energy, embodying the hope that the wearer will be a wise and just individual who is useful to society.",
    "asal": ["Yogyakarta", "Jawa Tengah"]
  },
  "7": {
    "name": "Batik Kawung",
    "desc": "Batik Kawung is one of Indonesia's oldest and most recognizable batik motifs, originating from the royal courts of Central Java. Its design is characterized by a classic geometric pattern of four intersecting circles or ovals, often with a small dot or rhombus at the center, resembling the cross-section of the aren palm fruit (known as kawung). This ancient pattern carries deep philosophical meaning, symbolizing purity, perfection, and the universe's structure. The four main circles represent the cardinal directions, while the center signifies the source of universal energy, embodying the hope that the wearer will be a wise and just individual who is useful to society.",
    "asal": ["Yogyakarta", "Jawa Tengah"]
  },
  "6": {
    "name": "Batik Parang",
    "desc": "Batik Parang is one of Indonesia's most powerful and classic batik motifs, defined by its distinctive diagonal pattern of flowing, parallel lines that resemble the letter 'S'. The name \"Parang\" is derived from the Javanese word for 'knife' or 'machete', and the motif is often interpreted as symbolizing the sharp, continuous motion of a weapon or the powerful, unceasing waves of the ocean crashing against a cliff. Originating as a batik larangan (forbidden batik) from the royal courts of Java, it was once reserved exclusively for the ruling sovereign and signified power, nobility, and unwavering determination. The unbroken continuity of the pattern represents a ceaseless struggle for self-improvement and welfare, embodying a spirit that never gives up.",
    "asal": ["Yogyakarta", "Jawa Tengah"]
  },
  "8": {
    "name": "Batik Megamendung",
    "desc": "Batik Megamendung is an iconic motif originating from the coastal city of Cirebon, West Java, and is heavily influenced by Chinese cultural artistry. Its name translates to \"overcast clouds,\" and the design is easily recognized by its large, stylized cloud patterns, typically arranged in horizontal, layered formations. A defining characteristic of Megamendung is its use of distinct color gradations, traditionally seven layers ranging from dark to light blue, which create a sense of depth and visual harmony. Far from representing gloom, the \"overcast\" cloud symbolizes patience, tranquility, and the ability to remain calm and cool-headed, even in difficult times. This philosophical depth, combined with its striking visual appeal, has made Megamendung one of Indonesia's most famous and beloved batik patterns.",
    "asal": "Cirebon"
  },
  "9": {
    "name": "Batik Gajah Oling",
    "desc": "Batik Gajah Oling is the most famous and iconic batik motif originating from Banyuwangi, East Java, serving as a powerful symbol of the region's identity. The name translates to \"Elephant Eel,\" which describes its unique primary shape—a large, curved form resembling a question mark that evokes both an elephant's trunk (*gajah*) and the sinuous body of an eel (*oling*). This central motif, often surrounded by smaller patterns like leaves, flowers, or butterflies, carries a deep philosophical meaning for the local community. It serves as a sacred reminder to always remember the Almighty (*eling* to *kang Maha Agung*), with the trunk-like form symbolising greatness and divine power. More than just a pattern, Gajah Oling embodies the spiritual and cultural character of the people of Banyuwangi.",
    "asal": "Banyuwangi"
  },
  "10": {
    "name": "Batik Sumatera Utara",
    "desc": "Of course, here is a description for Batik from North Sumatra. Batik from North Sumatra is a vibrant and distinct category of Indonesian textile art that translates the region's rich ethnic symbolism onto cloth using the wax-resist dyeing technique. Rather than having a single iconic motif, North Sumatran batik draws its inspiration from the diverse cultural heritage of its peoples, most notably the Batak and Malay communities. The designs often incorporate powerful symbols adapted from traditional *ulos* weavings and intricate *gorga* carvings, such as the *boraspati ni huta* (a protective lizard deity) and geometric patterns that signify blessings and social status. Characterized by bold lines and a palette that frequently uses the striking Batak combination of red, white, and black, this batik serves as a modern medium to celebrate and preserve the unique identity, philosophy, and customary laws (*adat*) of North Sumatra.",
    "asal": "Sumatera Utara"
  }
}
